#!/usr/bin/env python

# André von Kugland <kugland@gmail.com>

# Gera tabelas de acentos para o KLC, cobrindo — porém — apenas
# os acentos usados no mapa abnt2-ext. A tabela gerada é idêntica
# àquela do X11.

combining = {
	# Combining grave
	0x0300: {
		' ': '`', '`': '`', 'a': 'à', 'e': 'è',
		'i': 'ì', 'n': 'ǹ', 'o': 'ò', 'u': 'ù',
		'v': 'ǜ', 'w': 'ẁ', 'y': 'ỳ', 'ü': 'ǜ'
	},

	# Combining acute
 	0x0301: {
	 	' ': "'", 'a': 'á', 'c': 'ć', 'e': 'é',
		'g': 'ǵ', 'i': 'í', 'k': 'ḱ', 'l': 'ĺ',
		'm': 'ḿ', 'n': 'ń', 'o': 'ó', 'p': 'ṕ',
		'r': 'ŕ', 's': 'ś', 'u': 'ú', 'v': 'ǘ',
		'w': 'ẃ', 'y': 'ý', 'z': 'ź', '´': '´',
		'ç': 'ḉ', 'ü': 'ǘ'
	},

	# Combining circumflex
	0x0302: {
		' ': '^', '+': '⁺', '-': '⁻', '1': '¹',
		'2': '²', '3': '³', '4': '⁴', '5': '⁵',
		'6': '⁶', '7': '⁷', '8': '⁸', '9': '⁹',
		'=': '⁼', '^': '^', 'a': 'â', 'c': 'ĉ',
		'e': 'ê', 'g': 'ĝ', 'h': 'ĥ', 'i': 'î',
		'j': 'ĵ', 'o': 'ô', 's': 'ŝ', 'u': 'û',
		'w': 'ŵ', 'y': 'ŷ', 'z': 'ẑ'
	},

	# Combining tilde
	0x0303: {
		' ': '~', '=': '≃', 'a': 'ã', 'e': 'ẽ',
		'i': 'ĩ', 'n': 'ñ', 'o': 'õ', 'u': 'ũ',
		'v': 'ṽ', 'y': 'ỹ', '~': '~'
	},

	# Combining macron
	0x0304: {
		' ': '¯', 'a': 'ā', 'e': 'ē', 'g': 'ḡ',
		'i': 'ī', 'o': 'ō', 'u': 'ū', 'v': 'ǖ',
		'y': 'ȳ', '¯': '¯', 'ü': 'ǖ'
	},

	# Combining breve
	0x0306: {
		' ': '˘', 'a': 'ă', 'e': 'ĕ', 'g': 'ğ',
		'i': 'ĭ', 'o': 'ŏ', 'u': 'ŭ', '˘': '˘'
	},

	# Combining dot above
	0x0307: {
		' ': '˙', 'a': 'ȧ', 'b': 'ḃ', 'c': 'ċ',
		'd': 'ḋ', 'e': 'ė', 'f': 'ḟ', 'g': 'ġ',
		'h': 'ḣ', 'i': 'ı', 'j': 'ȷ', 'l': 'ŀ',
		'm': 'ṁ', 'n': 'ṅ', 'o': 'ȯ', 'p': 'ṗ',
		'r': 'ṙ', 's': 'ṡ', 't': 'ṫ', 'w': 'ẇ',
		'x': 'ẋ', 'y': 'ẏ', 'z': 'ż', '˙': '˙'
	},

	# Combining diaeresis
	0x0308: {
		' ': '¨', 'a': 'ä', 'e': 'ë', 'h': 'ḧ',
		'i': 'ï', 'o': 'ö', 't': 'ẗ', 'u': 'ü',
		'w': 'ẅ', 'x': 'ẍ', 'y': 'ÿ', '¨': '¨'
	},


	# Combining ring above
	0x030a: {
		' ': '°', 'a': 'å', 'w': 'ẘ', '°': '°'
	},

	# Combining double acute
	0x030b: {
		' ': '˝', 'o': 'ő', 'u': 'ű', '˝': '˝'
	},

	# Combining caron
	0x030c: {
		' ': 'ˇ', '0': '₀', '1': '₁', '2': '₂',
		'3': '₃', '8': '₈', '9': '₉', '=': '₌',
		'a': 'ǎ', 'c': 'č', 'd': 'ď', 'e': 'ě',
		'g': 'ǧ', 'h': 'ȟ', 'i': 'ǐ', 'j': 'ǰ',
		'k': 'ǩ', 'l': 'ľ', 'n': 'ň', 'o': 'ǒ',
		'r': 'ř', 's': 'š', 't': 'ť', 'u': 'ǔ',
		'v': 'ǚ', 'z': 'ž', 'ü': 'ǚ', 'ˇ': 'ˇ'
	},

	# Combining dot below
	0x0323: {
		' ': '.', '-': '⨪', '.': '.', '=': '⩦',
		'a': 'ạ', 'b': 'ḅ', 'd': 'ḍ', 'e': 'ẹ',
		'h': 'ḥ', 'i': 'ị', 'k': 'ḳ', 'l': 'ḷ',
		'm': 'ṃ', 'n': 'ṇ', 'o': 'ọ', 'r': 'ṛ',
		's': 'ṣ', 't': 'ṭ', 'u': 'ụ', 'v': 'ṿ',
		'w': 'ẉ', 'y': 'ỵ', 'z': 'ẓ'
	},

	# Combining comma below
	0x0326: {
		' ': ',', ',': ',', 's': 'ș', 't': 'ț'
	},

	# Combining cedilla
	0x0327: {
		' ': '¸', 'c': 'ç', 'd': 'ḑ', 'e': 'ȩ',
		'g': 'ģ', 'h': 'ḩ', 'k': 'ķ', 'l': 'ļ',
		'n': 'ņ', 'r': 'ŗ', 's': 'ş', 't': 'ţ',
		'¸': '¸'
	},

	# Combining ogonek
	0x0328: {
		' ': '˛', 'a': 'ą', 'e': 'ę', 'i': 'į',
		'o': 'ǫ', 'u': 'ų', '˛': '˛'
	},

	# Combining macron below
	0x0331: {
		'r': 'ṟ', 't': 'ṯ', 'd': 'ḏ', 'h': 'ẖ',
		'k': 'ḵ', 'l': 'ḻ', 'z': 'ẕ', 'b': 'ḇ',
		'n': 'ṉ'
	},

	# Combining strike
	0x0337: {
		' ': '/', '2': 'ƻ', '=': '≠', 'a': 'ⱥ',
		'b': 'ƀ', 'c': 'ȼ', 'd': 'đ', 'e': 'ɇ',
		'g': 'ǥ', 'h': 'ħ', 'i': 'ɨ', 'j': 'ɉ',
		'l': 'ł', 'o': 'ø', 'p': 'ᵽ', 'r': 'ɍ',
		't': 'ŧ', 'u': 'ʉ', 'y': 'ɏ', 'z': 'ƶ'
	}
}

def print_line(c0, c1):
	if c0.upper() != c0:
		print_line(c0.upper(), c1.upper())
	if len(c0) == 1 and len(c1) == 1:
		print("%04X\t%04X\t// %c => %c" % (ord(c0), ord(c1), c0, c1))

for comb, lst in sorted(combining.items()):
	print('DEADKEY %04X' % (comb))
	for c0, c1 in sorted(lst.items()):
		print_line(c0, c1)
	print('')
